# Assignment 6

In [4]:
import pandas as pd

In [7]:
#creating dataframes
d1={'Id':['A1','A2','A3','A4','A5'],'Name':['Vivek','Rahul','Gaurav','Ankit','Vishaka'],'Age':['27','24','22','32','28']}
d2={'Id':['A1','A2','A3','A4'],'Address':['Delhi','Gurgaon','Noida','Pune'],'Qualification':['Btech','B.A','Bcom','B.Hons']}

In [8]:
df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)

# i.Illustrate the usage of merge to combine data frames

In [9]:
#Case 1. merging data on common columns 'Id'
#Inner Join
pd.merge (df1, df2)
#simple merge with no additional arguments performs an inner/equi join equivalent t

   Id    Name Age  Address Qualification
0  A1   Vivek  27    Delhi         Btech
1  A2   Rahul  24  Gurgaon           B.A
2  A3  Gaurav  22    Noida          Bcom
3  A4   Ankit  32     Pune        B.Hons

In [10]:
pd.merge (df1, df2, how='inner')
#produces output similar as above, as pandas merge by default is an equi join

   Id    Name Age  Address Qualification
0  A1   Vivek  27    Delhi         Btech
1  A2   Rahul  24  Gurgaon           B.A
2  A3  Gaurav  22    Noida          Bcom
3  A4   Ankit  32     Pune        B.Hons

In [11]:
#Left Join
pd.merge (df1, df2,how='left')
#matching and non matching records from left DF which is df1 is present in result d

   Id     Name Age  Address Qualification
0  A1    Vivek  27    Delhi         Btech
1  A2    Rahul  24  Gurgaon           B.A
2  A3   Gaurav  22    Noida          Bcom
3  A4    Ankit  32     Pune        B.Hons
4  A5  Vishaka  28      NaN           NaN

In [12]:
#Right Join
pd.merge (df1, df2,how='right')
#matching and non matching records from right DF, df2 will come in result df
#as of now we dont have any non matching record in right df

   Id    Name Age  Address Qualification
0  A1   Vivek  27    Delhi         Btech
1  A2   Rahul  24  Gurgaon           B.A
2  A3  Gaurav  22    Noida          Bcom
3  A4   Ankit  32     Pune        B.Hons

In [13]:
#outer join
pd.merge (df1, df2,how='outer')
#all the matching and non matching records are available in resultant dataset from

   Id     Name Age  Address Qualification
0  A1    Vivek  27    Delhi         Btech
1  A2    Rahul  24  Gurgaon           B.A
2  A3   Gaurav  22    Noida          Bcom
3  A4    Ankit  32     Pune        B.Hons
4  A5  Vishaka  28      NaN           NaN

In [16]:
#changed the merging key in data frame d2
import pandas as pd
d1 = {'Id': ['A1', 'A2', 'A3', 'A4', 'A5'],'Name':[ 'Vivek', 'Rahul', 'Gaurav', 'Ankit','vishak'],
      'Age': [27, 24, 22, 32, 28], }
d2 = {'ID': [ 'A1', 'A2', 'A3', 'A4'],'Address': [ 'Delhi', 'Gurgaon', 'Noida', 'Pu'],
      'Qualification': [ 'Btech', 'B.A', 'Bcom', 'B.hons']}

In [17]:
df1=pd.DataFrame (d1)
df2=pd. DataFrame (d2)

In [18]:
#lets check when merging keys are different ('Id' and 'ID')
pd.merge (df1, df2)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [ ]:
#df1 key column 'Id'
#df2 key column 'ID'
import pandas as pd
pd.merge(df1,df2,left_on='Id',right_on='ID',how='left')

# ii) Illustrate the usage of join to combine data frames

In [23]:
import pandas as pd
df1 = pd. DataFrame ({ 'key': ['KO', 'K1', 'K5', 'K3', 'K4', 'K2'],'A': ['A0', 'A1','A2','A3','A4','A5']})
df2= pd. DataFrame ({ 'key': ['KO', 'K1', 'K2'],'B': ['BO', 'B1', 'B2']})

In [24]:
#default nature of pandas join is left outer join
df1.join (df2, lsuffix=' _l', rsuffix=' join')

  key _l   A key join    B
0     KO  A0       KO   BO
1     K1  A1       K1   B1
2     K5  A2       K2   B2
3     K3  A3      NaN  NaN
4     K4  A4      NaN  NaN
5     K2  A5      NaN  NaN

# Create two dataframes with different index values.

In [26]:
df1 = pd. DataFrame ({ 'key': ['KO', 'K1', 'K5', 'K3', 'K4', 'K2'],'A': ['A0', 'A1','A2','A3','A4','A5']})
index= [0,1,2,3,4,5]
df2 = pd. DataFrame ({ 'key': ['KO', 'K1', 'K2'],'B': ['B0', 'B1', 'B2']},
index= [6,7,8])
df1.join (df2,lsuffix=' _l', rsuffix=' _r')
#df1 is left DF and df2 is right DF

  key _l   A key _r    B
0     KO  A0    NaN  NaN
1     K1  A1    NaN  NaN
2     K5  A2    NaN  NaN
3     K3  A3    NaN  NaN
4     K4  A4    NaN  NaN
5     K2  A5    NaN  NaN

In [27]:
#inner join
df1.join (df2,lsuffix=' _l', rsuffix=' _r',how='inner')############################

Empty DataFrame
Columns: [key _l, A, key _r, B]
Index: []

In [28]:
#outer join
df1.join (df2,lsuffix='_l', rsuffix='_r', how='outer')

  key_l    A key_r    B
0    KO   A0   NaN  NaN
1    K1   A1   NaN  NaN
2    K5   A2   NaN  NaN
3    K3   A3   NaN  NaN
4    K4   A4   NaN  NaN
5    K2   A5   NaN  NaN
6   NaN  NaN    KO   B0
7   NaN  NaN    K1   B1
8   NaN  NaN    K2   B2

# Case 2.Join on columns

In [29]:
import pandas as pd
df1=pd.DataFrame({'key1':['K0','K1','K5','K3','K4','K2'],'A':['A0','A1','A5','A3','A4','A5']})
df2=pd.DataFrame({'key2':['K0','K1','K2'],'B':['B0','B1','B2']})
df1=pd.DataFrame({'key1':['K0','K1','K5','K3','K4','K2'],'A':['A0','A1','A5','A3','A4','A5]})'
df2=pd.DataFrame({'key2':['K0','K1','K2'],'B':['B0','B1','B2']},index=[6,7,8])

SyntaxError: invalid syntax (<ipython-input-29-ff141f4b1781>, line 5)

In [30]:
#join on data frame column
df1.set_index('key1').join(df2.set_index ('key2'))

KeyError: "None of ['key1'] are in the columns"

# iii.Illustrate the use of concat to combine dataframes
Case 1. concat data frames on axis=0, default operation

In [ ]:
import pandas as pd
m1=pd.DataFrame ({'Name': [ 'Alex', 'Amy', 'Allen', 'Alice', 'Ayoung' ],'subject_id':['sub1','sub2','sub4','sub6','sub5'],
'Marks_scored':[98,90,87,69,781]},index=[1,2,3,4,5])
m2=pd.Dataframe